In [30]:
## IMPORTS ##
import pandas as pd
from recordlinkage import Compare, Index
from datetime import datetime
import numpy as np
import re

In [31]:
# Load anonymized and external datasets
anonymized_df = pd.read_csv('anonymised_dataE.csv')
register_df = pd.read_excel('public_data_registerE.xlsx')
results_df = pd.read_excel('public_data_resultsE.xlsx')
survey_names_df = pd.read_fwf('survey_listE.txt')

In [32]:
anonymized_df.head(50)

,Unnamed: 0,sex,evote,zip,education,citizenship,marital_status,party,age_group
0,1,Female,0,2400,Vocational bachelors educations,Denmark,Not married,Red,"(38,48]"
1,2,Male,1,2200,Masters programmes,Denmark,Married,Green,"(30,38]"
2,3,Female,1,2200,Vocational bachelors educations,Denmark,Not married,Green,"(18,30]"
3,4,Female,0,2200,Vocational Education and Training (VET),Denmark,Not married,Green,"(58,70]"
4,5,Female,0,2200,Vocational Education and Training (VET),Denmark,Not married,Green,"(58,70]"
5,6,Male,0,2300,Vocational bachelors educations,Germany,Not married,Green,"(30,38]"
6,7,Male,0,2100,Vocational Education and Training (VET),Denmark,Not married,Green,"(48,58]"
7,8,Male,0,2200,Upper secondary education,Denmark,Not married,Green,"(70,101]"
8,9,Female,1,2100,Bachelors programmes,Denmark,Not married,Red,"(38,48]"
9,10,Female,0,2100,Vocational Education and Training (VET),Denmark,Not married,Green,"(38,48]"
10,11,Female,1,2400,Vocational Education and Training (VET),Denmark,Married,Green,"(70,101]"
11,12,Female,0,2100,Primary education,Denmark,Not married,Green,"(18,30]"
12,13,Male,1,2100,Masters programmes,Denmark,Not married,Red,"(30,38]"
13,14,Female,0,2400,Vocational Education and Training (VET),Denmark,Not married,Green,"(58,70]"
14,15,Male,1,2300,Bachelors programmes,Denmark,Married,Red,"(18,30]"
15,16,Male,0,2300,Upper secondary education,Denmark,Married,Red,"(70,101]"
16,17,Female,1,2100,Primary education,Denmark,Not married,Green,"(18,30]"
17,18,Female,1,2300,Vocational Education and Training (VET),Denmark,Not married,Green,"(30,38]"
18,19,Female,1,2400,Vocational bachelors educations,Denmark,Not married,Red,"(48,58]"
19,20,Male,1,2200,Vocational Education and Training (VET),Iraq,Married,Green,"(30,38]"
20,21,Male,0,2100,Vocational Education and Training (VET),Denmark,Married,Green,"(48,58]"
21,22,Female,0,2100,Not stated,Denmark,Not married,Green,"(18,30]"
22,23,Female,0,2100,PhD programmes,Denmark,Not married,Green,"(30,38]"
23,24,Female,0,2400,Primary education,Denmark,Not married,Green,"(70,101]"
24,25,Female,0,2400,Upper secondary education,Denmark,Not married,Green,"(18,30]"
25,26,Male,0,2300,Vocational Education and Training (VET),Turkey,Married,Green,"(38,48]"
26,27,Male,1,2300,Primary education,Denmark,Married,Red,"(58,70]"
27,28,Female,0,2300,Primary education,Denmark,Married,Green,"(58,70]"
28,29,Male,0,2300,Vocational Education and Training (VET),Denmark,Not married,Red,"(58,70]"
29,30,Female,1,2300,Vocational Education and Training (VET),Denmark,Not married,Green,"(70,101]"
30,31,Female,1,2200,Vocational Education and Training (VET),Denmark,Not married,Green,"(38,48]"
31,32,Male,0,2400,Short cycle higher education,Denmark,Not married,Red,"(70,101]"
32,33,Male,0,2300,Vocational bachelors educations,Denmark,Married,Green,"(18,30]"
33,34,Female,0,2200,Vocational Education and Training (VET),Denmark,Not married,Green,"(18,30]"
34,35,Female,0,2400,Vocational Education and Training (VET),Denmark,Not married,Green,"(48,58]"
35,36,Female,0,2300,Vocational Education and Training (VET),Denmark,Married,Green,"(70,101]"
36,37,Male,1,2400,Vocational bachelors educations,Denmark,Married,Green,"(70,101]"
37,38,Male,1,2200,Vocational bachelors educations,Denmark,Not married,Red,"(70,101]"
38,39,Male,0,2400,Upper secondary education,Denmark,Married,Red,"(48,58]"
39,40,Male,1,2400,Vocational bachelors educations,Denmark,Married,Red,"(38,48]"
40,41,Male,0,2200,Vocational Education and Training (VET),Denmark,Not married,Red,"(70,101]"
41,42,Female,0,2100,Primary education,USA,Not married,Green,"(18,30]"
42,43,Male,1,2100,Upper secondary education,Denmark,Not married,Green,"(18,30]"
43,44,Male,0,2200,Vocational Education and Training (VET),Denmark,Married,Green,"(48,58]"
44,45,Female,1,2200,Masters programmes,Denmark,Married,Red,"(30,38]"
45,46,Female,0,2100,Upper secondary education,Denmark,Not married,Green,"(18,30]"
46,47,Female,0,2300,Primary education,Denmark,Married,Red,"(58,70]"
47,48,Female,0,2400,Vocational bachelors educations,Denmark,Not married,Red,"(38,48]"
48,49,Female,0,2400,Vocational bachelors educations,Denmark,Not married,Red,"(58,70]"
49,50,Female,0,2300,Primary education,Denmark,Married,Red,"(58,70]"

In [33]:
register_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted
0,"Turner, Destiny",Female,2001-04-01,2300,Latvia,Never married,2
1,"Smith, Ian",Male,1999-07-26,2200,Denmark,Never married,2
2,"Tucker, Kateland",Female,2001-06-19,2300,Denmark,Never married,1
3,"Robles Talavera, Troy",Male,2000-02-03,2100,Denmark,Never married,2
4,"Cordova, Lexis",Female,1999-08-25,2200,Denmark,Never married,2

In [34]:
ls = anonymized_df['marital_status'].unique().tolist()
sorted(ls)

['Married', 'Not married']

In [35]:
ls1 = register_df['marital_status'].unique().tolist()
sorted(ls1)

['Divorced', 'Married/separated', 'Never married', 'Widowed']

In [36]:
# Assume 'date_of_birth' is the column with DoB in the format 'YYYY-MM-DD'
current_date = datetime.now()  # Use a specific date like datetime(2024, 1, 1) if needed

register_df['age'] = register_df['dob'].apply(
    lambda dob: current_date.year - pd.to_datetime(dob).year - 
    ((current_date.month, current_date.day) < (pd.to_datetime(dob).month, pd.to_datetime(dob).day))
)

In [37]:
# Age Grouping
register_df['age_group'] = pd.cut(
    register_df['age'], 
    bins=[18, 30, 38, 48, 58, 70, 101],  # Bin edges
    labels=['(18,30]', '(30,38]', '(38,48]', '(48,58]', '(58,70]', '(70,101]']  # Corresponding labels
)

In [38]:
# Marital Status Recoding
status_mapping = {
    'Divorced': 'Not married',
    'Married/separated': 'Married',
    'Never married': 'Not married',
    'Widowed': 'Not married'
}
register_df['marital_status'] = register_df['marital_status'].map(status_mapping)

In [39]:
# Simulate PRAM for Sex
#might remove it
np.random.seed(42)  # For reproducibility
register_df['pram_sex'] = register_df['sex'].apply(
    lambda x: x if np.random.rand() < 0.7 else ('Male' if x == 'Female' else 'Female')
)

In [40]:
register_df.head(10)

,name,sex,dob,zip,citizenship,marital_status,last_voted,age,age_group,pram_sex
0,"Turner, Destiny",Female,2001-04-01,2300,Latvia,Not married,2,23,"(18,30]",Female
1,"Smith, Ian",Male,1999-07-26,2200,Denmark,Not married,2,25,"(18,30]",Female
2,"Tucker, Kateland",Female,2001-06-19,2300,Denmark,Not married,1,23,"(18,30]",Male
3,"Robles Talavera, Troy",Male,2000-02-03,2100,Denmark,Not married,2,24,"(18,30]",Male
4,"Cordova, Lexis",Female,1999-08-25,2200,Denmark,Not married,2,25,"(18,30]",Female
5,"Rodriguez, Jafet",Male,2000-10-10,2200,Turkey,Not married,1,24,"(18,30]",Male
6,"al-Ansari, Mukarram",Male,2002-01-09,2100,Denmark,Not married,1,22,"(18,30]",Male
7,"el-Noorani, Huwaida",Female,2003-02-23,2200,Denmark,Not married,2,21,"(18,30]",Male
8,"Ramirez-Salaz, Jasmine",Female,2003-06-04,2400,Denmark,Not married,1,21,"(18,30]",Female
9,"Newsum Schoenberg, Emoni",Female,1999-08-14,2300,Denmark,Not married,1,25,"(18,30]",Male

In [41]:
# Indexing to reduce comparison space
indexer = Index()
indexer.block(['zip', 'age_group'])  # Blocking on ziÃ¥ to speed up
candidate_links = indexer.index(anonymized_df, register_df)

# Compare quasi-identifiers
compare = Compare()
compare.exact('age_group', 'age_group', label='age_group')
compare.exact('marital_status', 'marital_status', label='marital_status')
# compare.string('sex', 'sex', method='levenshtein', label='sex') #doesn't make sense?

comparison_results = compare.compute(candidate_links, anonymized_df, register_df)

# Sum scores across features
comparison_results['score'] = comparison_results.sum(axis=1)

# Select matches above a threshold
threshold = 1.5  # Adjust based on your confidence level
matches = comparison_results[comparison_results['score'] >= threshold]

# Extract matched anonymized indices and corresponding public register indices
matched_anonymized_indices = matches.index.get_level_values(0)  # Anonymized dataset indices
matched_register_indices = matches.index.get_level_values(1)  # External dataset indices

# Merge matched records with public register
matched_register = register_df.loc[matched_register_indices]
matched_anonymized = anonymized_df.loc[matched_anonymized_indices]

In [42]:
print(comparison_results)

          age_group  marital_status  score
0   150           1               1      2
    152           1               0      1
    153           1               0      1
    156           1               0      1
    158           1               0      1
...             ...             ...    ...
167 1500          1               0      1
    1528          1               1      2
    1547          1               1      2
    1555          1               0      1
    1556          1               0      1

[14984 rows x 3 columns]

In [43]:
print(matched_anonymized)

     Unnamed: 0     sex  evote   zip                        education  \
0             1  Female      0  2400  Vocational bachelors educations
0             1  Female      0  2400  Vocational bachelors educations
0             1  Female      0  2400  Vocational bachelors educations
0             1  Female      0  2400  Vocational bachelors educations
0             1  Female      0  2400  Vocational bachelors educations
..          ...     ...    ...   ...                              ...
167         168  Female      0  2100  Vocational bachelors educations
167         168  Female      0  2100  Vocational bachelors educations
167         168  Female      0  2100  Vocational bachelors educations
167         168  Female      0  2100  Vocational bachelors educations
167         168  Female      0  2100  Vocational bachelors educations

    citizenship marital_status party age_group
0       Denmark    Not married   Red   (38,48]
0       Denmark    Not married   Red   (38,48]
0       Denmark    Not married   Red   (38,48]
0       Denmark    Not married   Red   (38,48]
0       Denmark    Not married   Red   (38,48]
..          ...            ...   ...       ...
167     Denmark    Not married   Red  (70,101]
167     Denmark    Not married   Red  (70,101]
167     Denmark    Not married   Red  (70,101]
167     Denmark    Not married   Red  (70,101]
167     Denmark    Not married   Red  (70,101]

[8498 rows x 9 columns]

In [44]:
# Extract ZIP code from the "Polling station" column
results_df['zip'] = results_df['zip'].str.extract(r'Polling station: ZIP (\d{4})')
results_df = results_df.dropna(subset=['zip'])
results_df['zip'] = results_df['zip'].astype(int)  # Convert ZIP to integer

# Calculate total valid votes per ZIP
results_df['valid_votes'] = results_df['Red'] + results_df['Green']

# Calculate vote probabilities
#match for zips the probability
results_df['party_red'] = results_df['Red'] / results_df['valid_votes']
results_df['party_green'] = results_df['Green'] / results_df['valid_votes']

In [45]:
# Merge matched_register with public_results on zip
matched_register_1 = matched_register.merge(results_df, on='zip', how='left')

In [46]:
# Assign inferred political preference
#this is random, but keeps distribution
def assign_party(row):
    if np.random.rand() < row['party_red']:
        return 'Red'
    else:
        return 'Green'

matched_register_1['inferred_party'] = matched_register_1.apply(assign_party, axis=1)

In [47]:
# Combine inferred political preference with name
reidentified_data_1 = matched_register_1[['name', 'inferred_party']]

# Filter the reidentified data to include only rows with names in survey_names_df
filtered_reidentified_data_1 = reidentified_data_1[reidentified_data_1['name'].isin(survey_names_df['name'])]

filtered_reidentified_data_agg = filtered_reidentified_data_1.groupby('name').agg({
    'inferred_party': lambda x: x.mode()[0]  # Get the most frequent (mode) value
}).reset_index()

# Save to CSV
filtered_reidentified_data_agg.to_csv('reidentified_data_E_1.csv', index=False)

In [48]:
filtered_reidentified_data_agg

                        name inferred_party
0           Adams, Margarita          Green
1                Adams, Sage            Red
2           Alcantar, Amanda          Green
3         Alexander, Faridah            Red
4    Alvarez Mendez, Vanessa          Green
..                       ...            ...
195        el-Othman, Azeema          Green
196      el-Rashed, Fawzaana          Green
197          el-Saab, Muhsin            Red
198         el-Shahidi, Sadi          Green
199       el-Siddique, Raadi          Green

[200 rows x 2 columns]

In [49]:
# Check the distribution of inferred political preferences
print(filtered_reidentified_data_agg['inferred_party'].value_counts()) 

## HERE IT SAYS THAT 73% had voted green but in total it was 65%. It is not too far away from each other.

Green    144
Red       56
Name: inferred_party, dtype: int64

In [50]:
# # Step 4: Merge the public register with public results on the ZIP code
# matched_register_2 = matched_register.merge(results_df[['zip', 'party_red', 'party_green']], on='zip', how='left')

# # Assign the most probable political preference based on the probabilities
# matched_register_2['inferred_party'] = matched_register_2.apply(
#     lambda row: 'Red' if row['party_red'] > row['party_green'] else 'Green',
#     axis=1
# )

# # Remove duplicates, keeping only the first occurrence of each name
# final_data = matched_register_2.drop_duplicates(subset='name', keep='first')

In [51]:
# # Combine inferred political preference with name
# reidentified_data_2 = final_data[['name', 'inferred_party']]
# # Filter the reidentified data to include only rows with names in survey_names_df
# filtered_reidentified_data_2 = reidentified_data_2[reidentified_data_2['name'].isin(survey_names_df['name'])]

# # Save to CSV
# # filtered_reidentified_data_agg.to_csv('reidentified_data_E_1.csv', index=False)


### IT LOOKS LIKE THIS METHOD MAKES EVERYONE GREEN

In [52]:
len(filtered_reidentified_data['name'].unique().tolist())

NameError: name 'filtered_reidentified_data' is not defined